.data
number1: .word 0xffffffff
number2: .word 0x1

.text
.globl main

main:
    lw $s0, number1          # Φόρτωση του πρώτου αριθμού στον $s0
    lw $s1, number2          # Φόρτωση του δεύτερου αριθμού στον $s1

    addu $s2, $s0, $s1       # Πρόσθεση των αριθμών χωρίς να λαμβάνεται υπόψη το carry

    xor $t0, $s0, $s1        # XOR των αριθμών για να βρούμε όπου δεν υπάρχει carry
    and $t1, $s0, $s1        # AND των αριθμών για να βρούμε όπου υπάρχει carry
    and $t2, $s2, $t0        # AND του αποτελέσματος με το XOR για να διαγράψουμε non-carry bits
    or $t3, $t1, $t2         # OR των carry bits
    srl $s3, $t3, 31         # Ελέγχουμε το πιο αριστερό bit για το κρατούμενο

    # Εάν το MSB είναι 1, γεμίζουμε το $s3 με 1
    sll $s3, $s3, 31         # Μετατοπίζουμε το bit πίσω στην αρχική του θέση
    sra $s3, $s3, 31         # Κάνουμε αριθμητική μετατόπιση δεξιά για να γεμίσουμε με 1 όλα τα bits εάν το MSB ήταν 1

    # Τερματισμός του προγράμματος
    li $v0, 10
    syscall
